abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
#include "ch32v00x.h"
#include "ch32v00x_exti.h"
#include "ch32v00x_flash.h"
#include "ch32v00x_gpio.h"
#include "ch32v00x_misc.h"
#include "ch32v00x_pwr.h"
#include "ch32v00x_rcc.h"
#include "ch32v00x_tim.h"
#include "ch32v00x_usart.h"
#include "config.h"
#include "debug.h"
#include <stdint.h>
#include <string.h>

#if USE_WIRELESS_LORA
#include "lora_sx1278.h"
#define radio_init() lora_init()
#define radio_send(buf, len) lora_send(buf, len)
#define radio_available() lora_available()
#define radio_read(buf, len) lora_read(buf, len)
#define radio_power_up_tx() lora_power_up_tx()
#define radio_power_up_rx() lora_power_up_rx()
#define radio_power_down() lora_power_down()
#define radio_flush_rx() ((void)0)
#define radio_set_tx_addr(a) ((void)0)
#define radio_take_rpd() (1)
#else
#include "nrf24_simple.h"
#define radio_init() nrf24_init()
#define radio_send(buf, len) nrf24_send(buf, len)
#define radio_available() nrf24_available()
#define radio_read(buf, len) nrf24_read(buf, len)
#define radio_power_up_tx() nrf24_power_up_tx()
#define radio_power_up_rx() nrf24_power_up_rx()
#define radio_power_down() nrf24_power_down()
#define radio_flush_rx() nrf24_flush_rx()
#define radio_set_tx_addr(a) nrf24_set_tx_addr(a)
#define radio_take_rpd() nrf24_take_rpd_latched()
#endif

/* ========== Function Prototypes ========== */
void gpio_init(void);
void adc_init(void);
void exti_init(void);
void pwr_sleep_init(void);
void timer_init(void);
void enter_deep_sleep(void);
void flash_read_settings(void);
void flash_save_settings(void);
void iwdg_init(void);
uint8_t read_tank_level(void);
uint8_t read_battery_level(void);
void run_pairing(void);
uint32_t millis(void);
uint8_t calculate_checksum(const uint8_t *data, uint8_t length);

static inline void iwdg_feed(void) {
#if ENABLE_HARDWARE_IWDG
  IWDG_ReloadCounter();
#endif
}

typedef struct runtime_state runtime_state_t;
static void send_instant_force_update(runtime_state_t *runtime);

typedef struct runtime_state {
  uint32_t button_press_start;
  bool pairing_triggered;
  uint16_t sleep_cycle_count;
  uint32_t seq_num;
  uint8_t last_sent_level;
  uint8_t pending_level;
  uint8_t wake_retry_count;
  uint8_t filtered_level;
  uint8_t candidate_level;
  uint8_t candidate_count;
  bool first_reading_done;
  uint8_t current_battery;
  bool battery_initialized;
  uint8_t retry_cooldown;
  uint8_t link_quality;
  uint8_t last_rpd_seen;
  bool link_quality_valid;
} runtime_state_t;

typedef enum {
  BUTTON_ACTION_NONE = 0,
  BUTTON_ACTION_FORCE_SEND,
  BUTTON_ACTION_REBOOT,
  BUTTON_ACTION_FACTORY_RESET,
} button_action_t;

typedef enum {
  TX_WAIT_TIMEOUT = 0,
  TX_WAIT_ACK_RECEIVED,
  TX_WAIT_LEVEL_CHANGED,
  TX_WAIT_ABORTED,
} tx_wait_result_t;

typedef enum {
  TX_SEND_NO_ACK = 0,
  TX_SEND_ACKED,
  TX_SEND_RESTART_LEVEL,
  TX_SEND_ABORTED,
} tx_send_result_t;

static volatile uint8_t g_sensor_event_pending = 0;
static volatile uint8_t g_button_event_pending = 0;
static runtime_state_t g_runtime;

/* ========== Power Management & AWU ========== */
void pwr_sleep_init(void) {
  // Enable PWR clock
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

  // Configure LSI for AWU
  RCC_LSICmd(ENABLE);
  while (RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == RESET)
    ;

  // Enable AWU interrupt in NVIC
  NVIC_InitTypeDef NVIC_InitStructure = {0};
  NVIC_InitStructure.NVIC_IRQChannel = AWU_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

void AWU_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void AWU_IRQHandler(void) {
  EXTI_ClearITPendingBit(EXTI_Line9);
  NVIC_ClearPendingIRQ(AWU_IRQn);
}

void exti_init(void) {
  // Enable AFIO and PWR clock BEFORE configuring line mapping
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);

  EXTI_InitTypeDef EXTI_InitStructure = {0};
  NVIC_InitTypeDef NVIC_InitStructure = {0};

  // Button Pin on Port D: PD6 (Active LOW - Falling Edge Wakeup)
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOD, GPIO_PinSource6);
  EXTI_InitStructure.EXTI_Line = EXTI_Line6;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  // Auto Wake-up (AWU) Event on EXTI Line 9
  EXTI_InitStructure.EXTI_Line = EXTI_Line9;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  // Enable NVIC for Button EXTI Line 6
  NVIC_InitStructure.NVIC_IRQChannel = EXTI7_0_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  // Enable NVIC for AWU Auto Wake-up
  NVIC_InitStructure.NVIC_IRQChannel = AWU_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

void EXTI7_0_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void EXTI7_0_IRQHandler(void) {
  if (EXTI_GetITStatus(EXTI_Line6) != RESET) {
    g_button_event_pending = 1;
    EXTI_ClearITPendingBit(EXTI_Line6);
  }
}

void enter_deep_sleep(void) {
  DEBUG_PRINT("[PWR] Sleep (5s AWU)...\r\n");
  Delay_Ms(5); // Flush UART

  // 1. Ensure all power pins & LEDs are OFF during deep sleep
  SENSOR_POWER_OFF(); // Keep Common wire P-MOSFET OFF
  LED_OFF();          // Ensure LED is OFF in sleep (Active-HIGH)
  radio_power_down(); // Ensure SX1278 is in 0.2uA Sleep Mode

  // 2. Stop 1ms TIM2 timer to prevent instant wakeups
  TIM_Cmd(TIM2, DISABLE);
  TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);
  NVIC_DisableIRQ(TIM2_IRQn);
  NVIC_ClearPendingIRQ(TIM2_IRQn);

  // 3. Re-arm Auto Wakeup (AWU) timer for 5s (LSI ~128kHz / 61440 = 2.08Hz -> 10 counts = ~5s)
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);
  PWR_AWU_SetPrescaler(PWR_AWU_Prescaler_61440);
  PWR_AWU_SetWindowValue(10); // ~5 seconds periodic wake-up
  PWR_AutoWakeUpCmd(ENABLE);  // Arm the downcounter

  // 4. Clear all previous pending interrupt flags
  EXTI->INTFR = 0xFFFFFFFF;
  EXTI_ClearITPendingBit(EXTI_Line9 | EXTI_Line6);
  NVIC_ClearPendingIRQ(AWU_IRQn);
  NVIC_ClearPendingIRQ(EXTI7_0_IRQn);

