abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  // 5. Enter Stop mode (SLEEPDEEP=1, PDDS=0)
  PWR->CTLR &= ~PWR_CTLR_PDDS; // PDDS = 0
  NVIC->SCTLR |= (1 << 2);     // Set SLEEPDEEP

  iwdg_feed(); // Feed watchdog right before sleeping (8s window for 5s sleep)
  __WFI(); // Wait for Interrupt (AWU timer fires in 5s OR user presses button)
  iwdg_feed(); // Feed watchdog immediately upon waking

  // 6. Cleanup sleep state
  NVIC->SCTLR &= ~(1 << 2); // Clear SLEEPDEEP
  PWR_AutoWakeUpCmd(DISABLE);
  EXTI_ClearITPendingBit(EXTI_Line9 | EXTI_Line6);
  NVIC_ClearPendingIRQ(AWU_IRQn);

  // 7. System resumes here after wake up - Restart clocks & TIM2 timer
  SystemCoreClockUpdate();
  EXTI->INTFR = 0xFFFFFFFF;

  // Restart TIM2 1ms timer
  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  NVIC_EnableIRQ(TIM2_IRQn);
  TIM_Cmd(TIM2, ENABLE);

  DEBUG_PRINT("[PWR] Wake\r\n");

  // Essential re-init after deep sleep
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOC |
                             RCC_APB2Periph_GPIOA | RCC_APB2Periph_ADC1 |
                             RCC_APB2Periph_AFIO | RCC_APB2Periph_SPI1,
                         ENABLE);
  gpio_init();
  adc_init();

  Delay_Ms(5); // Short stabilization delay
}

/* ========== Flash Storage (Last Page 64-byte) with CRC-8 Integrity ========== */
#define SETTINGS_FLASH_ADDR 0x08003FC0
#define SETTINGS_MAGIC      0xAA55

typedef struct __attribute__((packed)) {
  uint16_t magic;          // 0xAA55 Signature
  uint16_t tank_id;        // 16-bit Tank ID
  uint8_t  pairing_status; // 1 = Paired, 0 = Not Paired
  uint8_t  crc8;           // CRC-8 checksum of first 5 bytes
  uint16_t reserved;       // Padding to 8 bytes (two 32-bit words)
} sensor_settings_t;

sensor_settings_t g_settings;

void flash_read_settings(void) {
  memcpy(&g_settings, (void *)SETTINGS_FLASH_ADDR, sizeof(sensor_settings_t));

  // 1. Check Magic Header (0xAA55)
  if (g_settings.magic != SETTINGS_MAGIC) {
    DEBUG_PRINT("[FL] Magic 0x%04X != 0xAA55 -> Unprogrammed Flash. Init defaults.\r\n",
                g_settings.magic);
    g_settings.magic = SETTINGS_MAGIC;
    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    g_settings.crc8 = 0;
    return;
  }

  // 2. Validate CRC-8 Checksum over first 5 bytes (magic + tank_id + pairing_status)
  uint8_t calc_crc = calculate_checksum((const uint8_t *)&g_settings, 5);
  if (g_settings.crc8 != calc_crc) {
    DEBUG_PRINT("[FL] CRC Error (Read:0x%02X != Calc:0x%02X)! Flash Corrupted -> Reset defaults.\r\n",
                g_settings.crc8, calc_crc);
    g_settings.magic = SETTINGS_MAGIC;
    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    g_settings.crc8 = 0;
    return;
  }

  DEBUG_PRINT("[FL] Loaded Valid Settings (ID:0x%04X Status:%d CRC:0x%02X)\r\n",
              g_settings.tank_id, g_settings.pairing_status, g_settings.crc8);
}

void flash_save_settings(void) {
  g_settings.magic = SETTINGS_MAGIC;
  g_settings.crc8 = calculate_checksum((const uint8_t *)&g_settings, 5);
  g_settings.reserved = 0;

  FLASH_Unlock();
  FLASH_ErasePage(SETTINGS_FLASH_ADDR);

  uint32_t *pData = (uint32_t *)&g_settings;
  for (uint16_t i = 0; i < (sizeof(sensor_settings_t) + 3) / 4; i++) {
    FLASH_ProgramWord(SETTINGS_FLASH_ADDR + (i * 4), pData[i]);
  }
  FLASH_Lock();
  DEBUG_PRINT("[FL] Saved ID:0x%04X S:%d CRC:0x%02X\r\n", g_settings.tank_id,
              g_settings.pairing_status, g_settings.crc8);
}

/* ========== Independent Hardware Watchdog (IWDG) ========== */
void iwdg_init(void) {
#if ENABLE_HARDWARE_IWDG
  IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
  IWDG_SetPrescaler(IWDG_Prescaler_256); // 128kHz / 256 = 500Hz (2ms per tick)
  IWDG_SetReload(IWDG_RELOAD_VALUE);     // 4000 ticks = 8.0 seconds timeout
  IWDG_ReloadCounter();
  IWDG_Enable();
  DEBUG_PRINT("[SYS] Hardware IWDG Watchdog Initialized (~10s Timeout)\r\n");
#endif
}

/* ========== Global Variables ========== */
const uint8_t PAIRING_ADDR[3] = {0xE7, 0xE7,
                                 0xE7}; // Address for pairing packets
volatile uint32_t g_millis = 0;         // Current system time in ms
uint8_t g_probe_fault = 0; // 1 = Fault detected (e.g., gap in readings)

static inline bool is_button_pressed(void) {
  return GPIO_ReadInputDataBit(GPIOD, BUTTON_PIN) == 0;
}

static void reset_runtime_tracking(runtime_state_t *runtime) {
  runtime->button_press_start = 0;
  runtime->pairing_triggered = false;
  runtime->sleep_cycle_count = 0;
  runtime->seq_num = 0;
  runtime->last_sent_level = 0xFF;
  runtime->pending_level = 0xFF;
  runtime->wake_retry_count = 0;
  runtime->filtered_level = 0;
  runtime->candidate_level = 0xFF;
  runtime->candidate_count = 0;
  runtime->first_reading_done = false;
  runtime->current_battery = 0;
  runtime->battery_initialized = false;
  runtime->retry_cooldown = 0;
  runtime->link_quality = 0;
  runtime->last_rpd_seen = 0;
  runtime->link_quality_valid = false;
  g_sensor_event_pending = 0;
  g_button_event_pending = 0;
}

static uint8_t sample_filtered_level(runtime_state_t *runtime) {
  uint8_t raw_level = read_tank_level();

  if (!runtime->first_reading_done) {
    runtime->filtered_level = raw_level;
    runtime->candidate_level = raw_level;
    runtime->candidate_count = 0;
    runtime->first_reading_done = true;
    DEBUG_PRINT("[SYSTEM] Init Level: %d%%\r\n", runtime->filtered_level);
  } else if (raw_level == runtime->filtered_level) {
    // Level is steady and matches confirmed level -> reset candidate tracking
    runtime->candidate_count = 0;
    runtime->candidate_level = raw_level;
  } else {
    // Raw level differs from current confirmed level
    if (raw_level == runtime->candidate_level) {
      runtime->candidate_count++;
      DEBUG_PRINT("[SYS] Candidate Lvl %d%% hold (%d/%d)\r\n",
                  runtime->candidate_level, runtime->candidate_count,
                  LEVEL_DEBOUNCE_CYCLES);

      if (runtime->candidate_count >= LEVEL_DEBOUNCE_CYCLES) {
        runtime->filtered_level = runtime->candidate_level;
        runtime->candidate_count = 0;
        DEBUG_PRINT("[SYS] Lvl Confirmed: %d%%\r\n", runtime->filtered_level);
      }
    } else {
      // First time seeing this new level -> start candidate tracking
      runtime->candidate_level = raw_level;
      runtime->candidate_count = 1;
      DEBUG_PRINT("[SYS] New Candidate Lvl %d%% (1/%d)\r\n",
                  runtime->candidate_level, LEVEL_DEBOUNCE_CYCLES);

