abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
#if (LEVEL_DEBOUNCE_CYCLES <= 1)
      runtime->filtered_level = runtime->candidate_level;
      runtime->candidate_count = 0;
      DEBUG_PRINT("[SYS] Lvl Confirmed: %d%%\r\n", runtime->filtered_level);
#endif
    }
  }

  return runtime->filtered_level;
}

static uint8_t build_link_quality_sample(uint8_t attempt, bool ack_received,
                                         bool rpd_seen) {
  if (!ack_received) {
    return rpd_seen ? 10 : 0;
  }

  uint8_t max_attempt = (DATA_MAX_RETRIES > 0) ? (DATA_MAX_RETRIES - 1) : 0;
  if (attempt > max_attempt) {
    attempt = max_attempt;
  }

  uint8_t penalty = 0;
  if (max_attempt > 0) {
    penalty = (uint8_t)(((uint16_t)attempt * 80U) / (uint16_t)max_attempt);
  }

  uint8_t score = (uint8_t)(100U - penalty);
  if (score < 20U) {
    score = 20U;
  }

  if (rpd_seen && score < 100U) {
    uint8_t boosted = (uint8_t)(score + 8U);
    score = (boosted > 100U) ? 100U : boosted;
  }

  return score;
}

static void update_link_quality(runtime_state_t *runtime, uint8_t attempt,
                                bool ack_received, bool rpd_seen) {
  uint8_t sample = build_link_quality_sample(attempt, ack_received, rpd_seen);
  runtime->last_rpd_seen = rpd_seen ? 1 : 0;

  if (!runtime->link_quality_valid) {
    runtime->link_quality = sample;
    runtime->link_quality_valid = true;
    return;
  }

  runtime->link_quality =
      (uint8_t)((((uint16_t)runtime->link_quality * 3U) + sample + 2U) / 4U);
}

static button_action_t poll_button_action(runtime_state_t *runtime) {
  bool button_pressed = is_button_pressed();

  if (button_pressed) {
    uint32_t now = millis();
    if (runtime->button_press_start == 0) {
      runtime->button_press_start = now;
      DEBUG_PRINT("[SYSTEM] Button Pressed\r\n");
    }

    if (!runtime->pairing_triggered &&
        (now - runtime->button_press_start) >= RESET_PRESS_TIME_MS) {
      runtime->pairing_triggered = true;
      return BUTTON_ACTION_FACTORY_RESET;
    }

    return BUTTON_ACTION_NONE;
  }

  if (runtime->button_press_start == 0) {
    return BUTTON_ACTION_NONE;
  }

  uint32_t held_ms = millis() - runtime->button_press_start;
  runtime->button_press_start = 0;

  if (runtime->pairing_triggered) {
    runtime->pairing_triggered = false;
    return BUTTON_ACTION_NONE;
  }

  // 3s to 5s Hold -> Device Reboot (Keeps pairing ID intact)
  if (held_ms >= REBOOT_PRESS_TIME_MS && held_ms < RESET_PRESS_TIME_MS) {
    return BUTTON_ACTION_REBOOT;
  }

  // 50ms to 3s Click -> Force Instant Send
  if (held_ms >= 50 && held_ms < REBOOT_PRESS_TIME_MS) {
    return BUTTON_ACTION_FORCE_SEND;
  }

  return BUTTON_ACTION_NONE;
}

static void send_unpair_before_reset(void) {
  DEBUG_PRINT("Sending UNPAIR before reset\r\n");

  uint8_t unpair_pkt[32] = {0};
  unpair_pkt[0] = 0xAA;
  unpair_pkt[1] = 0x55;
  unpair_pkt[2] = 0x06; // PKT_TYPE_UNPAIR
  unpair_pkt[3] = 32;
  unpair_pkt[4] = (uint8_t)(g_settings.tank_id & 0xFF);
  unpair_pkt[5] = (uint8_t)(g_settings.tank_id >> 8);
  unpair_pkt[31] = calculate_checksum(unpair_pkt, 32);

  radio_power_up_tx();
  radio_set_tx_addr(PAIRING_ADDR);
  for (int i = 0; i < 20; i++) {
    radio_send(unpair_pkt, 32);
    Delay_Ms(30);
  }
  radio_power_down();
}

static void handle_button_action(runtime_state_t *runtime,
                                 button_action_t action) {
  runtime->button_press_start = 0;
  runtime->pairing_triggered = false;
  g_button_event_pending = 0;

  if (action == BUTTON_ACTION_NONE) {
    return;
  }

  if (action == BUTTON_ACTION_FACTORY_RESET) {
    DEBUG_PRINT("[SYS] FACTORY RESET (>5s Hold)\r\n");

    if (g_settings.pairing_status == 1 && g_settings.tank_id != 0) {
      send_unpair_before_reset();
    }

    g_settings.tank_id = 0;
    g_settings.pairing_status = 0;
    flash_save_settings();

    reset_runtime_tracking(runtime);
    run_pairing();
    return;
  }

  if (action == BUTTON_ACTION_REBOOT) {
    DEBUG_PRINT("[SYS] Reboot (3s Hold)...\r\n");
    // 2 slow blinks before restart
    for (int b = 0; b < 2; b++) {
      LED_ON();
      Delay_Ms(150);
      LED_OFF();
      Delay_Ms(150);
    }
    NVIC->SCTLR |= (1 << 31); // SYSRESETREQ
    return;
  }

  if (action == BUTTON_ACTION_FORCE_SEND) {
    send_instant_force_update(runtime);
    return;
  }
}

static bool packet_matches_data_ack(uint8_t *packet, uint32_t seq_num) {
  if (packet[0] != 0xAA || packet[1] != 0x55 ||
      packet[2] != PKT_TYPE_DATA_ACK) {
    return false;
  }

  uint16_t ack_id = (uint16_t)packet[4] | ((uint16_t)packet[5] << 8);
  uint32_t ack_seq = (uint32_t)packet[6] | ((uint32_t)packet[7] << 8) |
                     ((uint32_t)packet[8] << 16) | ((uint32_t)packet[9] << 24);

  return (ack_id == g_settings.tank_id && ack_seq == seq_num);
}

static tx_wait_result_t
service_runtime_window(runtime_state_t *runtime, uint32_t wait_ms,
                       bool listen_for_ack, uint8_t attempt, uint32_t seq_num) {
  uint32_t start = millis();

  while (1) {
    uint32_t now = millis();
    if ((now - start) >= wait_ms) {
      break;
    }

    if (listen_for_ack && radio_available()) {
      uint8_t rx[32];
      radio_read(rx, 32);

      if (packet_matches_data_ack(rx, seq_num)) {
        DEBUG_PRINT("[ACK] OK try:%d\r\n", attempt);
        return TX_WAIT_ACK_RECEIVED;
      }

      for (uint8_t j = 0; j < 32; j++) {
        rx[j] = (uint8_t)~rx[j];
      }

      if (packet_matches_data_ack(rx, seq_num)) {
        DEBUG_PRINT("[ACK] OK(inv) try:%d\r\n", attempt);
        return TX_WAIT_ACK_RECEIVED;
      }
    }

    bool button_pressed = is_button_pressed();
    if (g_button_event_pending || runtime->button_press_start != 0 ||
        button_pressed) {
      g_button_event_pending = 0;
      button_action_t action = poll_button_action(runtime);
      if (action != BUTTON_ACTION_NONE) {
        handle_button_action(runtime, action);
        return TX_WAIT_ABORTED;
      }
    }

    iwdg_feed(); // Feed watchdog during active listening window
    Delay_Ms(1);
  }

  return TX_WAIT_TIMEOUT;
}

static void prepare_data_packet(uint8_t *packet, uint8_t current_level) {
  memset(packet, 0, 32);

  packet[0] = 0xAA;
  packet[1] = 0x55;
  packet[2] = 0x02;
  packet[3] = 32;
  packet[4] = (uint8_t)(g_settings.tank_id & 0xFF);
  packet[5] = (uint8_t)(g_settings.tank_id >> 8);
  packet[6] = current_level;
  packet[7] = g_runtime.current_battery;

  packet[8] = 0;
  if (g_runtime.current_battery <= BATTERY_LOW_THRESHOLD) {
    packet[8] |= 0x01; // Low Battery Flag
  }

  packet[9] = g_probe_fault;
  packet[10] = g_runtime.link_quality_valid ? g_runtime.link_quality : 0xFF;
  packet[11] = g_runtime.last_rpd_seen;
  packet[12] = (uint8_t)(g_runtime.seq_num & 0xFF);
  packet[13] = (uint8_t)((g_runtime.seq_num >> 8) & 0xFF);
  packet[14] = (uint8_t)((g_runtime.seq_num >> 16) & 0xFF);
  packet[15] = (uint8_t)((g_runtime.seq_num >> 24) & 0xFF);
  packet[31] = calculate_checksum(packet, 32);
}

