abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
static tx_send_result_t send_data_with_retry(runtime_state_t *runtime,
                                             uint8_t *packet) {
  for (uint8_t attempt = 0; attempt < DATA_MAX_RETRIES; attempt++) {
    radio_power_up_tx();
    radio_set_tx_addr(PAIRING_ADDR);

#if USE_WIRELESS_LORA
    // LoRa: 1 clean packet per attempt so sensor enters RX before Controller
    // sends ACK
    radio_send(packet, 32);
#else
    for (int burst = 0; burst < 3; burst++) {
      radio_send(packet, 32);

      tx_wait_result_t gap_result =
          service_runtime_window(runtime, 10, false, attempt, runtime->seq_num);
      if (gap_result == TX_WAIT_ABORTED) {
        radio_power_down();
        return TX_SEND_ABORTED;
      }
    }
#endif

    DEBUG_PRINT("[TX] Seq:%lu try:%d\r\n", (unsigned long)runtime->seq_num,
                attempt);

    radio_flush_rx();
    radio_power_up_rx();

    tx_wait_result_t ack_result = service_runtime_window(
        runtime, DATA_ACK_WAIT_MS, true, attempt, runtime->seq_num);
    bool rpd_seen = radio_take_rpd();

    if (ack_result == TX_WAIT_ACK_RECEIVED) {
      update_link_quality(runtime, attempt, true, rpd_seen);
      radio_power_down();
      return TX_SEND_ACKED;
    }
    if (ack_result == TX_WAIT_ABORTED) {
      radio_power_down();
      return TX_SEND_ABORTED;
    }

    update_link_quality(runtime, attempt, false, rpd_seen);

    if (attempt < DATA_MAX_RETRIES - 1) {
      uint32_t retry_jitter_ms =
          DATA_RETRY_DELAY_MS + ((millis() + attempt) & 0x1F) * 2;
      tx_wait_result_t retry_result = service_runtime_window(
          runtime, retry_jitter_ms, false, attempt, runtime->seq_num);
      if (retry_result == TX_WAIT_ABORTED) {
        radio_power_down();
        return TX_SEND_ABORTED;
      }
    }
  }

  radio_power_down();
  return TX_SEND_NO_ACK;
}

static void send_instant_force_update(runtime_state_t *runtime) {
  DEBUG_PRINT("[SYS] Single Click -> Force Instant Send\r\n");

  // 1 Fast Blink Acknowledgement
  LED_ON();
  Delay_Ms(50);
  LED_OFF();

  if (g_settings.pairing_status != 1) {
    DEBUG_PRINT("[SYS] Not Paired -> Run Pairing\r\n");
    return;
  }

  uint8_t current_level = read_tank_level();
  runtime->filtered_level = current_level;
  runtime->last_sent_level = current_level;
  runtime->sleep_cycle_count = 0;
  read_battery_level();

  uint8_t packet[32];
  prepare_data_packet(packet, current_level);
  tx_send_result_t res = send_data_with_retry(runtime, packet);
  runtime->seq_num++; // Always advance sequence number for fresh tracking
  if (res == TX_SEND_ACKED) {
    DEBUG_PRINT("[DATA] Force Send -> ACK OK\r\n");
  } else {
    DEBUG_PRINT("[DATA] Force Send -> No ACK\r\n");
  }
}

/* ========== TIM2 for millis (1ms) ========== */
void TIM2_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void TIM2_IRQHandler(void) {
  if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
    g_millis++;
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
  }
}

void timer_init(void) {
  TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure = {0};
  NVIC_InitTypeDef NVIC_InitStructure = {0};
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

  // Period 9 and Prescaler for 1ms interrupt
  TIM_TimeBaseStructure.TIM_Period = 9;
  TIM_TimeBaseStructure.TIM_Prescaler = (SystemCoreClock / 10000) - 1;
  TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
  TIM_Cmd(TIM2, ENABLE);
}

uint32_t millis(void) { return g_millis; }

/* ========== GPIO Init ========== */
void gpio_init(void) {
  GPIO_InitTypeDef GPIO_InitStructure = {0};
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOD | RCC_APB2Periph_GPIOA, ENABLE);

  // Button: PD6 (Input Pull-up)
  GPIO_InitStructure.GPIO_Pin = BUTTON_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  // LED: PD2 (Output Push-pull)
  GPIO_InitStructure.GPIO_Pin = LED_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  LED_OFF(); // Turn off at start (Active-HIGH)

  // Sensor Common Power: PD3 (Pin 20 - Output Push-pull controlling Q6 P-MOSFET)
  GPIO_InitStructure.GPIO_Pin = SENSOR_POWER_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
  SENSOR_POWER_OFF(); // Keep Common wire P-MOSFET OFF at start

  // Sensor Pins: PC0, PC1, PC2, PC4 (Input Pull-up)
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
  GPIO_InitStructure.GPIO_Pin =
      SENSOR_PIN_25 | SENSOR_PIN_50 | SENSOR_PIN_75 | SENSOR_PIN_100;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
  GPIO_Init(GPIOC, &GPIO_InitStructure);

  // Initialize EXTI for these pins
  exti_init();
}

/**
 * @brief Reads all tank probes and applies software patches for hardware
 * reliability and fault monitoring.
 *
 * 1. FAULT DETECTION: Detects if high probes are wet while lower probes are dry
 *    to alert the user about possible broken wires or dirty sensors.
 *
 * 2. BROKEN WIRE FIX: Even if a lower probe is faulty, the function
 *    automatically fills in the gap in software to ensure the displayed
 *    water level remains accurate.
 *
 * Benefit: Prevents "jumpy" or incorrect readings and provides a "Service
 * Required" alert if hardware maintenance is needed.
 */
uint8_t read_internal_probes(uint8_t *fault_out) {
  // 1. Power ON the common probe wire via Q6 P-MOSFET (Full VCC to water)
  SENSOR_POWER_ON();
  Delay_Ms(PROBE_SETTLE_DELAY_MS); // 10ms robust stabilization for long tank wires & low-TDS water

