abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  // 2. Take multi-samples to filter contact resistance & AC ripple (2ms multi-sample)
  uint8_t c25 = 0, c50 = 0, c75 = 0, c100 = 0;
  for (int s = 0; s < PROBE_SAMPLE_COUNT; s++) {
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_25) == 0)
      c25++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_50) == 0)
      c50++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_75) == 0)
      c75++;
    if (GPIO_ReadInputDataBit(GPIOC, SENSOR_PIN_100) == 0)
      c100++;
    Delay_Ms(2);
  }

  // 3. Power OFF probe wire immediately (keeps average power < 0.01mW & 0% corrosion)
  SENSOR_POWER_OFF();
  Delay_Ms(1); // Settle & drain residual wire capacitance

  // Majority vote: >= PROBE_MAJORITY_VOTE out of PROBE_SAMPLE_COUNT (e.g. >= 3 out of 5)
  uint8_t p25 = (c25 >= PROBE_MAJORITY_VOTE);
  uint8_t p50 = (c50 >= PROBE_MAJORITY_VOTE);
  uint8_t p75 = (c75 >= PROBE_MAJORITY_VOTE);
  uint8_t p100 = (c100 >= PROBE_MAJORITY_VOTE);

  DEBUG_PRINT("[PROBES] Raw hits (out of %d): [25%%]:%d [50%%]:%d [75%%]:%d [100%%]:%d\r\n",
              PROBE_SAMPLE_COUNT, c25, c50, c75, c100);

  // --- FAULT DETECTION LOGIC: Bitmask Mode ---
  uint8_t fault_mask = 0;
  if (p100) {
    if (!p75)
      fault_mask |= (1 << 2);
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p75) {
    if (!p50)
      fault_mask |= (1 << 1);
    if (!p25)
      fault_mask |= (1 << 0);
  } else if (p50) {
    if (!p25)
      fault_mask |= (1 << 0);
  }

  if (fault_out)
    *fault_out = fault_mask;

  // --- HARDWARE PATCH: Broken Wire Fix ---
  if (p100) {
    p75 = 1;
    p50 = 1;
    p25 = 1;
  } else if (p75) {
    p50 = 1;
    p25 = 1;
  } else if (p50) {
    p25 = 1;
  }

  if (p100)
    return 100;
  if (p75)
    return 75;
  if (p50)
    return 50;
  if (p25)
    return 25;
  return 0;
}

uint8_t read_tank_level(void) {
  uint8_t fault = 0;
  uint8_t level = read_internal_probes(&fault);
  g_probe_fault = fault;

  DEBUG_PRINT("[DATA] Tank Level: %d%%\r\n", level);
  return level;
}

/* ========== ADC for Battery Monitoring (PA1) ========== */
void adc_init(void) {
  ADC_InitTypeDef ADC_InitStructure = {0};

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
  RCC_ADCCLKConfig(RCC_PCLK2_Div8);

#if (!USE_INTERNAL_VREF_BATTERY)
  // PA1 Analog In only needed if using external resistor divider
  GPIO_InitTypeDef GPIO_InitStructure = {0};
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
  GPIO_InitStructure.GPIO_Pin = BATTERY_ADC_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
#endif

  ADC_DeInit(ADC1);
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);

  ADC_Cmd(ADC1, ENABLE);

  // Calibration
  ADC_ResetCalibration(ADC1);
  while (ADC_GetResetCalibrationStatus(ADC1))
    ;
  ADC_StartCalibration(ADC1);
  while (ADC_GetCalibrationStatus(ADC1))
    ;
}

uint16_t get_adc_val(uint8_t ch) {
  ADC_RegularChannelConfig(ADC1, ch, 1, ADC_SampleTime_241Cycles);
  ADC_SoftwareStartConvCmd(ADC1, ENABLE);
  volatile uint32_t timeout = 50000;
  while (!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) && --timeout)
    ;
  if (timeout == 0) {
    DEBUG_PRINT("[ADC] TIMEOUT ch%d!\r\n", ch);
    return 0;
  }
  return ADC_GetConversionValue(ADC1);
}

static uint8_t voltage_to_battery_percent(uint32_t v_bat_mv) {
  if (v_bat_mv >= 3150)
    return 100;
  if (v_bat_mv >= 3050) {
    // 3050..3150 mV -> 80%..100%
    return (uint8_t)(80 + ((v_bat_mv - 3050) * 20) / 100);
  }
  if (v_bat_mv >= 2950) {
    // 2950..3050 mV -> 50%..80%
    return (uint8_t)(50 + ((v_bat_mv - 2950) * 30) / 100);
  }
  if (v_bat_mv >= 2880) {
    // 2880..2950 mV -> 20%..50%
    return (uint8_t)(20 + ((v_bat_mv - 2880) * 30) / 70);
  }
  if (v_bat_mv >= 2820) {
    // 2820..2880 mV -> 5%..20% (Low Battery Warning Zone)
    return (uint8_t)(5 + ((v_bat_mv - 2820) * 15) / 60);
  }
  if (v_bat_mv >= 2800) {
    // 2800..2820 mV -> 0%..5% (Critical Zone - Replace Battery)
    return (uint8_t)(((v_bat_mv - 2800) * 5) / 20);
  }
  return 0; // Below 2.80V = 0% (Working Cutoff)
}

uint8_t read_battery_level(void) {
  uint32_t accum = 0;
  uint8_t i;

  // 1. Measure Internal 1.20V Bandgap Reference (Channel 8)
  for (i = 0; i < 8; i++)
    accum += get_adc_val(ADC_Channel_Vrefint);
  uint16_t vref_raw = (uint16_t)(accum / 8);

  if (vref_raw == 0)
    return g_runtime.current_battery;

  uint32_t v_bat_mv;

#if USE_INTERNAL_VREF_BATTERY
  // Direct Internal Bandgap Calculation: Zero External Resistors & 0uA Leakage Current!
  // Formula: Vbat = (Vrefint_mV * 1023) / vref_raw
  v_bat_mv = (1200UL * 1023UL) / (uint32_t)vref_raw;
#else
  // Legacy External Resistor Divider mode via PA1 (100k + 100k)
  accum = 0;
  for (i = 0; i < 8; i++)
    accum += get_adc_val(BATTERY_ADC_CHANNEL);
  uint16_t bat_raw = (uint16_t)(accum / 8);

  v_bat_mv = ((uint32_t)bat_raw * BAT_VOLTAGE_SCALE) / vref_raw;
#endif

  uint8_t raw_percent = voltage_to_battery_percent(v_bat_mv);
  DEBUG_PRINT("[BAT] %lumV (%s, Raw:%d%%)\r\n", (unsigned long)v_bat_mv,
              USE_INTERNAL_VREF_BATTERY ? "InternalVref" : "Divider",
              raw_percent);

  // 1. First Reading after Boot / Power-On Reset -> direct accept
  if (!g_runtime.battery_initialized || g_runtime.current_battery == 0) {
    g_runtime.current_battery = raw_percent;
    g_runtime.battery_initialized = true;
    DEBUG_PRINT("[BAT] Init: %d%%\r\n", g_runtime.current_battery);
    return g_runtime.current_battery;
  }

  // 2. Sudden High Jump Rule (> +20% jump indicates fresh battery inserted)
  if (raw_percent > (g_runtime.current_battery + 20)) {
    g_runtime.current_battery = raw_percent;
    DEBUG_PRINT("[BAT] New Battery Replaced! High Jump: %d%%\r\n",
                g_runtime.current_battery);
    return g_runtime.current_battery;
  }

  // 3. IIR Smoothing Filter (75% Old + 25% New) for temperature & noise stability
  uint8_t filtered = (uint8_t)((((uint16_t)g_runtime.current_battery * 3U) +
                                raw_percent + 2U) /
                               4U);

  // 4. Monotonic Rule: Disallow upward drift due to sun heating unless confirmed
  if (filtered > g_runtime.current_battery &&
      (filtered - g_runtime.current_battery) <= 5) {
    filtered = g_runtime.current_battery;
  }

  g_runtime.current_battery = filtered;
  DEBUG_PRINT("[BAT] Filtered: %d%%\r\n", g_runtime.current_battery);
  return g_runtime.current_battery;
}

