abdul-basit-shaikh/CH32V003F4P6_tank_sensor/User/main.c
  // SAFETY: Delay at boot to allow WCH-Link to connect before MCU sleeps.
  // This is the most reliable way to prevent "Lockout" during development.
  DEBUG_PRINT("[SYS] SafeDelay %dms.. ", BOOT_SAFETY_DELAY_MS);
  Delay_Ms(BOOT_SAFETY_DELAY_MS);
  DEBUG_PRINT("OK\r\n");

  __enable_irq();

  DEBUG_PRINT("Init Radio...\r\n");
  radio_init();
  radio_power_down(); // Start in low power mode

  // Load settings from Flash
  flash_read_settings();

  if (g_settings.pairing_status == 1) {
    DEBUG_PRINT("[SYS] Paired ID:0x%04X\r\n", g_settings.tank_id);
    radio_set_tx_addr(PAIRING_ADDR); // Ensure address is set
  } else {
    DEBUG_PRINT("[SYS] NOT PAIRED. Hold button to pair\r\n");
  }

  // Boot UI: Fast 5x blink (60ms ON, 60ms OFF = 360ms total)
  for (int i = 0; i < 5; i++) {
    LED_ON(); // ON
    Delay_Ms(100);
    LED_OFF(); // OFF
    Delay_Ms(100);
  }
  LED_OFF(); // Extra safety: ensure LED is OFF

  DEBUG_PRINT("[SYS] Idle (Hold btn=pair)\r\n");

  reset_runtime_tracking(&g_runtime);

  // Initialize Independent Hardware Watchdog (~8s Zero-Freeze Protection)
  iwdg_init();

  while (1) {
    iwdg_feed(); // Feed watchdog at start of each cycle

    // 1. Button Handling
    bool button_pressed = is_button_pressed();
    if (g_button_event_pending || g_runtime.button_press_start != 0 ||
        button_pressed) {
      g_button_event_pending = 0;

      button_action_t button_action = poll_button_action(&g_runtime);
      if (button_action != BUTTON_ACTION_NONE) {
        handle_button_action(&g_runtime, button_action);
        continue;
      }

      if (button_pressed) {
        Delay_Ms(10);
        continue;
      }
    }

    // 2. Data Logic (Only if paired)
    if (g_settings.pairing_status == 1) {
      uint8_t current_level = sample_filtered_level(&g_runtime);
      bool heartbeat_due = (g_runtime.sleep_cycle_count >= HEARTBEAT_CYCLES);

      // Track Level Changes & Wake Attempts (Max 3 Wake-ups per level change)
      if (g_runtime.last_sent_level == 0xFF) {
        // Initial boot state
        g_runtime.pending_level = current_level;
      } else if (current_level != g_runtime.last_sent_level) {
        if (current_level != g_runtime.pending_level) {
          // Brand new water level detected! Reset wake retry counter
          g_runtime.pending_level = current_level;
          g_runtime.wake_retry_count = 0;
        }
      } else {
        // Level is in sync with last confirmed level
        g_runtime.pending_level = current_level;
        g_runtime.wake_retry_count = 0;
      }

      bool level_changed = (current_level != g_runtime.last_sent_level);

      // Decide if send is required
      bool need_send = false;
      if (g_runtime.last_sent_level == 0xFF) {
        need_send = true; // First send on power-on
      } else if (level_changed) {
        if (g_runtime.wake_retry_count < 3) {
          need_send = true; // Within 3 wake attempts
        }
      } else if (heartbeat_due) {
        need_send = true; // 4-hour routine heartbeat
      }

      // Read battery when sending
      if (need_send && (g_runtime.last_sent_level == 0xFF || heartbeat_due ||
                        g_runtime.current_battery == 0)) {
        g_runtime.current_battery = read_battery_level();
        DEBUG_PRINT("[BAT] Battery level: %d%%\r\n", g_runtime.current_battery);
        Delay_Ms(10);
      }

      if (need_send) {
        uint8_t packet[32];
        prepare_data_packet(packet, current_level);

        uint8_t current_try = g_runtime.wake_retry_count + 1;
        DEBUG_PRINT(
            "[TX] %s Seq:%lu L:%d%% (Wake:%d/3) B:%d%% Q:%u%% R:%u F:%d\r\n",
            level_changed ? "CHG" : "HB", (unsigned long)g_runtime.seq_num,
            current_level, current_try, g_runtime.current_battery,
            g_runtime.link_quality, g_runtime.last_rpd_seen, g_probe_fault);

        tx_send_result_t tx_result = send_data_with_retry(&g_runtime, packet);

        if (tx_result == TX_SEND_ABORTED) {
          continue;
        }

        bool ack_received = (tx_result == TX_SEND_ACKED);
        if (ack_received) {
          // Success! Confirmed by controller
          g_runtime.last_sent_level = current_level;
          g_runtime.pending_level = current_level;
          g_runtime.wake_retry_count = 0;
          g_runtime.seq_num++;
        } else {
          // NO ACK after DATA_MAX_RETRIES (15 tries)
          DEBUG_PRINT("[TX] NO ACK on wake attempt %d/3 after %d retries\r\n",
                      current_try, DATA_MAX_RETRIES);
          g_runtime.wake_retry_count++;
          g_runtime.seq_num++;

          if (g_runtime.wake_retry_count >= 3) {
            // Stop sending after 3 wake attempts
            g_runtime.last_sent_level = current_level;
            DEBUG_PRINT("[SYS] 3 wake attempts done without ACK. Level %d%% "
                        "stopped.\r\n",
                        current_level);
          }
        }

        g_runtime.sleep_cycle_count = 0;
      }
    } else {
      DEBUG_PRINT("[SYS] Not paired. Hold button to pair.\r\n");
    }

    // 3. Enter Deep Sleep (Saves battery in both paired and un-paired mode)
    DEBUG_PRINT("[SYS] Sleep\r\n");
    DEBUG_PRINT("----------\r\n");
    enter_deep_sleep();
    g_runtime.sleep_cycle_count++; // Increment cycles on each AWU wake
  }
}
